<?php

return [
    "notifications" => [
        "order_status_changes" => "الطلب رقم :number قد تغيرت حالته الى :status",
        "more" => "اضغط هنا لمعرفة المزيد.",
        "new_order"=>"يوجد طلب جديد متاح حاليا",
        "update_order"=>"تم تعديل الطلب الحالي",
        "accept_order" =>"اضغط هنا لقبول الطلب",
        "not_arrived_yet" => "الطلب رقم :number , لم يصل السائق بعد الى المطعم",
        "driver_coming" => "السائق :driver قادم ليتسلم الطلب منك",
        "not_accepted_yet" => "الطلب رقم :number لم يتم قبوله من اى سائق حتى الآن",
    ],
    "auth" => [
        "invalid" => "تفاصيل الحساب غير صحيحة",
        "verify" => "يرجى تفعيل من حسابك",
        "disabled" => "تم تعطيل المستخدم الخاص بك ، يرجى الاتصال بالمسؤول",
        "logout" => "تم تسجيل الخروج بنجاح",
        "created" => "تم إنشاء حسابك بنجاح",
        "reg" => "نجح تسجيلك ، تم إرسال رمز التفعيل إلى هاتفك",
        "driver_verify" => "تم التحقق من الحساب بنجاح ، يرجى انتظار تأكيد تفاصيل المسؤول",
        "generate_code" => "إنشاء رمز بنجاح",
        "try" => "حاول مجددا",
        "mail_code" => "تم إرسال بريد إلكتروني إلى بريدك الإلكتروني مع رمز إعادة التعيين",
        "phone_code" => "تم إرسال رمز إعادة تعيين إلى رقم هاتفك",
        "wrong" => "هناك خطأ ما",
        "code" => "الرمز غير صحيح",
        "password_changed" => "تم تغيير الرقم السري بنجاح",
        "already" => "تم تنشيط حسابك بالفعل",
        "code_expired" => "انتهى وقت إعادة تعيين الرمز ، حاول إعادة إرسال الرمز",
        "invalid_old_password" => "كلمة المرور القديمة غير صحيحة",
        "your_account" => "حسابك الان  :statue",
    ],
    "charge" => [
        "invalid" => "الرجاء ادخال الكود الصحيح",
        "already" => "هذا الرمز مستخدم بالفعل ، يرجى إدخال رمز آخر",
        "success" => "شحن رصيدك بنجاح",
    ],

    "error" => [
        "error" => "حدث خطأ"
    ],

    "driver_order" => [
        "not_enough_balance" => "ليس لديك رصيد كافي!",
        "have_order" => "لديك طلب بالفعل ، يرجى الانتهاء منه أولاً",
        "accepted_success" => "لقد قبلت الطلب بنجاح",
        "already_accepted" => "تم قبول الطلب من قبل سائق آخر",
        "taken_success" => "لقد تلقيت الطلب بنجاح",
        "qr_code_wrong" => "رمز الاستجابة السريعة غير متطابق",
        "delivered_success" => "لقد قمت بتسليم الطلب بنجاح",
        "not_in_range" => "مكانك الحالي بعيد عن الزبون, من فضلك حاول عندما تكون قريبا منه",
        "special_order_change" => "لقد تم تكليفك بتسليم الطلب رقم :number ، اذهب إلى المتجر للحصول عليه"
    ],
    "process" => [
        "create" => "تمت عملية الإنشاء بنجاح",
        "update" => "تمت عملية التحديث بنجاح",
        "delete" => "اكتمل الحذف",
        "save" => "تم الحفظ"
    ],
    "record" => [
        "create" => "تمت  انشاء السجل بنجاح",
        "update" => "تمت  تعديل السجل بنجاح",
        "delete" => "تمت  حذف السجل بنجاح",
        "save" => "تمت  حفظ السجل بنجاح",
    ],
    "lang" => [
        "change" => "تم تغيير لغتك بنجاح"
    ],
    "store_order"=>[
        "no_store" => "ليس لديك متجر",
        "no_order" => "ليس لديك طلب",
        "rated" => "الطلب :id تم تقييمه بنجاح",
        "suspended" => "تم تعليق الطلب. الرصيد غير كاف.",
        "reordered" => "تمت إعادة الطلب بنجاح"
    ],
    "place" => [
        "out_of_range" => "المسافة بعيدة او لا تخدم قطر التوصيل يرجى التأكد من العنوان المحدد"
    ],
    "create" => "اكتملت عملية الإنشاء",
    "update" => "اكتملت عملية التحديث",
    "delete" => "تمت عملية الحذف بنجاح",
    "failed" => "عفوًا ، حدث خطأ ما",
    "success" => "تمت العملية بنجاح",
    "archived" => "تمت أرشفة السجل (السجلات) الخاصة بك" ,
    "wait_for_admin" => "يرجى انتظار المسؤول للتأكيد",
    "wait_for_accepted" => " الرجاء الانتظار حتى يتم الموافقة",
    "please_verify_phone" => "من فضلك قم بتأكيد رقم هاتفك حيث انه تم توجيه رسالة بكود الى الرقم الجديد",
    "max_code_usage" => "لقد استخدمت الحد الأقصى للمحاولات 5 محاولات",
    "cancel" => "تم الغاء الطلبية",
    "can_not_cancel" => "لايمكن الغاء الطلبية لنا الحالة هي :status",
];
